app/controllers/application_controller.rb

  def authenticate_request
    token = User.find_by(token: params[:token])
---
SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]