app/controllers/players_controller.rb

SELECT "players".* FROM "players" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
---
  def index
    players = Player.all.paginate(page: params[:page], per_page:2)

SELECT MAX(match_date) FROM "players" WHERE "players"."id" IS NULL
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    player = Player.find_by(id: params[:id])

SELECT "players".* FROM "players" WHERE (player_name LIKE '%Deepak%')
---
  def search
    # keyword = params[:q]
    player = Player.where("player_name LIKE ?", "%#{params[:search]}%")

INSERT INTO "players" ("player_name", "batting_style", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["player_name", "Shubham Gill"], ["batting_style", "Right Hand Batsman"], ["team_id", 3], ["created_at", "2023-02-20 09:32:56.299661"], ["updated_at", "2023-02-20 09:32:56.299661"]]
---
  def create
    player = Player.create(
      player_name: pla_params[:player_name],
      batting_style: pla_params[:batting_style],
      team_id: pla_params[:team_id]
    )