app/controllers/teams_controller.rb

  def index
    teams = Team.all.paginate(page: params[:page], per_page:3)
---
SELECT "teams".* FROM "teams" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]

  def show
    # team = Team.find_by(id: params[:id])
    team = Team.joins(:tournaaments, :players).where(id: params[:id]).select("teams.*,tournaaments.team_id, tournaaments.no_of_matches, tournaaments.match_no, tournaaments.start_date, tournaaments.end_date, tournaaments.toss, players.player_name, players.batting_style")
---
SELECT teams.*,tournaaments.team_id, tournaaments.no_of_matches, tournaaments.match_no, tournaaments.start_date, tournaaments.end_date, tournaaments.toss, players.player_name, players.batting_style FROM "teams" INNER JOIN "tournaaments" ON "tournaaments"."team_id" = "teams"."id" INNER JOIN "players" ON "players"."team_id" = "teams"."id" WHERE "teams"."id" = ?  [["id", 1]]

  def create
    team = Team.create(
      team_name: tee_params[:team_name],
      captain_name: tee_params[:captain_name],
      jersey_color: tee_params[:jersey_color]
    )
    if team.save
---
INSERT INTO "teams" ("team_name", "captain_name", "jersey_color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["team_name", "Pune Super Giants"], ["captain_name", "Sourav Ganguly"], ["jersey_color", "Light Blue"], ["created_at", "2023-02-21 16:06:18.250461"], ["updated_at", "2023-02-21 16:06:18.250461"]]
UPDATE "teams" SET "team_name" = ?, "captain_name" = ?, "jersey_color" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["team_name", "Mumbai Indians"], ["captain_name", "Rohit Sharma"], ["jersey_color", "Blue"], ["updated_at", "2023-02-14 03:20:49.979956"], ["id", 2]]

  def update
    team = Team.find_by(id: params[:id])
    if team
      team.update(
        team_name: params[:team_name],
       captain_name: params[:captain_name],
       jersey_color: params[:jersey_color]
      )
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "teams" SET "team_name" = ?, "captain_name" = ?, "jersey_color" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["team_name", "Mumbai Indians"], ["captain_name", "Rohit Sharma"], ["jersey_color", "Blue"], ["updated_at", "2023-02-14 03:20:49.979956"], ["id", 2]]