app/controllers/tournaaments_controller.rb

  def index
    tournaaments = Tournaament.all.paginate(page: params[:page], per_page:4)
---
SELECT MAX("tournaaments"."id") FROM "tournaaments"
SELECT "tournaaments".* FROM "tournaaments" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]

  def max_order
    tournaament = Tournaament.maximum(:matches_played)
---
SELECT "tournaaments".* FROM "tournaaments" WHERE "tournaaments"."matches_played" = ? ORDER BY "tournaaments"."matches_played" ASC LIMIT ?  [["matches_played", "3"], ["LIMIT", 1]]
SELECT MAX("tournaaments"."id") FROM "tournaaments"

  def show
    tournaament = Tournaament.find_by(id: params[:id])
---
SELECT "tournaaments".* FROM "tournaaments" WHERE "tournaaments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def create
    tournaament = Tournaament.create(
      no_of_matches: tou_params[:no_of_matches],
      match_no: tou_params[:match_no],
      start_date: tou_params[:start_date],
      end_date: tou_params[:end_date],
      toss: tou_params[:toss],
      match_date: tou_params[:match_date],
      team_id: tou_params[:team_id],
      matches_played: tou_params[:matches_played]
    )
    if tournaament.save
---
INSERT INTO "tournaaments" ("no_of_matches", "match_no", "start_date", "end_date", "toss", "team_id", "created_at", "updated_at", "match_date", "matches_played") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "tournaaments" SET "no_of_matches" = ?, "toss" = ?, "updated_at" = ?, "match_date" = ? WHERE "tournaaments"."id" = ?  [["no_of_matches", "74"], ["toss", "Chennai Super Kings Won the toss"], ["updated_at", "2023-02-16 10:50:40.905695"], ["match_date", "11-02-2023"], ["id", 1]]

  def update
    tournaament = Tournaament.find_by(id: params[:id])

    if tournaament
      tournaament.update(
        no_of_matches: params[:no_of_matches],
       match_no: params[:match_no],
       start_date: params[:start_date],
       end_date: params[:end_date],
       toss: params[:toss],
       match_date: params[:match_date],
       team_id: params[:team_id],
       matches_played: params[:matches_played]
      )
---
SELECT "tournaaments".* FROM "tournaaments" WHERE "tournaaments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tournaaments" SET "match_no" = ?, "toss" = ?, "team_id" = ?, "updated_at" = ?, "matches_played" = ? WHERE "tournaaments"."id" = ?  [["match_no", "2"], ["toss", "Delhi  Won the toss"], ["team_id", 2], ["updated_at", "2023-02-17 06:19:37.903312"], ["matches_played", "1"], ["id", 2]]