app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "token", "expire_at", "logged_in", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
   user = User.new(user_params)
   if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rajankumar@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "expire_at" = ?, "logged_in" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "[FILTERED]"], ["expire_at", "2023-03-06 11:04:37.794368"], ["logged_in", 1], ["updated_at", "2023-03-06 10:49:37.795068"], ["id", 5]]
---
  def login
    user = User.find_by(email: params[:email])
    if user && user.password == params[:password]
      token = SecureRandom.hex(10)
      expire_at = Time.now + 15.minutes
      user.update(token: token, expire_at: expire_at)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rajankumar@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "expire_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "[FILTERED]"], ["expire_at", "2023-03-03 04:50:03.752264"], ["updated_at", "2023-03-03 04:35:03.760939"], ["id", 1]]
---
  def forget_password
    user = User.find_by(email: params[:email])
    if user
      token = SecureRandom.hex(10)
      expire_at = Time.now + 15.minutes
      user.update(token: token, expire_at: expire_at)

SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "expire_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "[FILTERED]"], ["expire_at", "2023-03-06 09:24:08.860470"], ["updated_at", "2023-03-06 09:09:08.860774"], ["id", 1]]
---
  def reset_password
    user = User.find_by(token: params[:token])
    if user && user.expire_at > Time.now
      user.update(password: params[:password])

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rajankumar@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "logged_in" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["logged_in", 0], ["updated_at", "2023-03-06 16:00:34.208122"], ["id", 1]]
---
  def logout
   user = User.find_by(email: params[:email])
   if user
   user.update(logged_in: false)